# IsApplicable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDuctFittingAndAccessoryPressureDropServer..::..IsApplicable Method
IDuctFittingAndAccessoryPressureDropServer Interface See Also
---
Check if the server is applicable for the duct fitting or duct accessory.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool IsApplicable(
	DuctFittingAndAccessoryPressureDropData data
)
```

Visual Basic
---
```text
Function IsApplicable ( _
	data As DuctFittingAndAccessoryPressureDropData _
) As Boolean
```

Visual C++
---
```text
bool IsApplicable(
	DuctFittingAndAccessoryPressureDropData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.DB.Mechanical..::..DuctFittingAndAccessoryPressureDropData The input data of the calculation.
# See Also
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace